# https://stepik.org/lesson/237240/step/10?unit=209628
# 1. Создайте GitHub-репозиторий, в котором будут лежать файлы conftest.py и
# test_items.py.
# 2. Добавьте в файл conftest.py обработчик, который считывает из командной
# строки параметр language.
# 3. Реализуйте в файле conftest.py логику запуска браузера с указанным языком
# пользователя. Браузер должен объявляться в фикстуре browser и передаваться в
# тест как параметр.
# 4. В файл test_items.py напишите тест, который проверяет, что страница товара
# на сайте содержит кнопку добавления в корзину. Например, можно проверять
# товар, доступный по
# http://selenium1py.pythonanywhere.com/catalogue/coders-at-work_207/.
# 5. Тест должен запускаться с параметром language следующей командой:
# pytest --language=es test_items.py
# и проходить успешно. Достаточно, чтобы код работал только для браузера Сhrome.
# 6. Отправить ссылку на данный репозиторий в качестве ответа на данное задание.
# 7. Отправить решение на рецензирование другим учащимся. Не забудьте, что
# решение на рецензирование можно отправить только один раз.
# 8. Проверьте решения минимум трех других учащихся, чтобы получить баллы за
# задание.
#
# Ваше решение будет проверяться по следующим критериям:
#
# 1. Тест в репозитории можно запустить командой pytest --language=es, тест
# успешно проходит.
# 2. Проверка работоспособности кода для разных языков. Добавьте в файл с
# тестом команду time.sleep(30) сразу после открытия ссылки. Запустите тест с
# параметром --language=fr и визуально проверьте, что фраза на кнопке добавления
# в корзину выглядит так: "Ajouter au panier".
# 3. Браузер должен объявляться в фикстуре browser и передаваться в тест как
# параметр.
# 4. В тесте проверяется наличие кнопки добавления в корзину. Селектор кнопки
# является уникальным для проверяемой страницы. Есть assert.
# 5. Название тестового метода внутри файла test_items.py соответствует задаче.
# Название test_something не удовлетворяет требованиям.
from selenium.webdriver.common.by import By

def test_add_to_cart_button_present(browser):
    browser.get('http://selenium1py.pythonanywhere.com/catalogue/coders-at-work_207/')
    button_add_to_cart = browser.find_element(By.CSS_SELECTOR,
                                              'button.btn-add-to-basket')
    assert button_add_to_cart